# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [4]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
#in pandas we use pd.series to specify series instead of the bracket type
series1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l')) #randint is a range
series2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
series3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))
print(series1, series2, series3)

0     2
1     3
2     1
3     1
4     1
     ..
95    1
96    4
97    1
98    4
99    4
Length: 100, dtype: int32 0     2
1     1
2     2
3     2
4     3
     ..
95    3
96    1
97    3
98    1
99    1
Length: 100, dtype: int32 0     21274
1     10216
2     16243
3     16144
4     10774
      ...
95    14034
96    19206
97    15620
98    14321
99    14581
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [17]:
housing = pd.concat([series1, series2, series3], axis=1)
housing

    0  1      2
0   2  2  21274
1   3  1  10216
2   1  2  16243
3   1  2  16144
4   1  3  10774
.. .. ..    ...
95  1  3  14034
96  4  1  19206
97  1  3  15620
98  4  1  14321
99  4  1  14581

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [22]:
housing.rename(columns = {0:'bedrs', 1:'bathrs', 2: 'price_sqr_meter'}, inplace=True)
#inplace means to replace
print(type(housing))
housing
#housing.head() will give first 5 lines

<class 'pandas.core.frame.DataFrame'>

    bedrs  bathrs  price_sqr_meter
0       2       2            21274
1       3       1            10216
2       1       2            16243
3       1       2            16144
4       1       3            10774
..    ...     ...              ...
95      1       3            14034
96      4       1            19206
97      1       3            15620
98      4       1            14321
99      4       1            14581

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [23]:
bigcolumn = pd.concat([series1, series2, series2], axis=0)
print(type(bigcolumn))
bigcolumn #still series

<class 'pandas.core.series.Series'>

0     2
1     3
2     1
3     1
4     1
     ..
95    3
96    1
97    3
98    1
99    1
Length: 300, dtype: int32

In [24]:
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn #now DataFrame

<class 'pandas.core.frame.DataFrame'>

    0
0   2
1   3
2   1
3   1
4   1
.. ..
95  3
96  1
97  3
98  1
99  1

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [25]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [27]:
bigcolumn.reset_index(drop=True, inplace=True)
#drop does not save column, inplace is if you dont want to reassign
bigcolumn

     0
0    2
1    3
2    1
3    1
4    1
..  ..
295  3
296  1
297  3
298  1
299  1

[300 rows x 1 columns]